library(lubridate)
library(readr)
library(stringi)
library(stringr)
library(splitstackshape)
library(tidyr)
library(writexl)
library(dplyr)
library(data.table)
list_of_files <- list.files(path = "c:/Users/Alex/D/phd/R/test", 
                            recursive = F,
                            pattern = "\\.txt$",
                            full.names = TRUE)
DT <- sapply(list_of_files, read_file)

removeStopwordComasSpaces <- function(file_){
  gsub('<|>|\\(|\\)|меньше|меньшн|больше|более|менее|iultra|\\(|ручная|\\)|
       \\(|автоматическая|\\)', '',
       gsub("[[:space:]]", "", 
            stringi::stri_trans_tolower(file_)))
}
dateCleanFormat <- function(file_){
  dd <- gsub('(0?[1-9]|[12]\\d|30|31)[.](0?[1-9]|1[0-2])[.](\\d{4})', 
             '\\1-\\2-\\3', file_)
  gsub('(0?[1-9]|[12]\\d|30|31)[.](0?[1-9]|1[0-2])[.](\\d{2})', 
       '\\1-\\2-20\\3', dd)
}

file_1 <- removeStopwordComasSpaces(DT) %>% 
  dateCleanFormat()


id <- unlist(str_extract(file_1, "\\d{1,6}"))

getTreatmentTable <- function(
  data
) {
  data <- DT
  file_1 <- removeStopwordComasSpaces(data) %>% 
  dateCleanFormat()

  id <- str_extract(file_1, "\\d{1,6}")
  
  birthday <- unlist(str_extract(file_1, "\\d{2}-\\d{2}-\\d{4}"))

  file_ <- stringr::str_extract(file_1, 
                                "(?<=проведенноелечение:).*?(?=рекомендации|наблюдение)" )
  
  masks <- c('лизиноприл','л.з.....ил|лизитар|лизинеоприл', 
             'цефтриаксон','три.....ф|цефт.....он|цефтриакосн', 
             "метопролол","мет.....ол|эгилок", 
             "фраксипарин","фра......ин",
             'тейкопланин', "тей......ин.",
             "", "свой|в/вкапельно|в\\в|в\\м",
             "ривароксабан", "ксарелт.|xarelto",
             "амброксол", "аброкол|амброко.|амб......|амброксолс\
                        |амброкосл|амброксолл|амброксолл|аброксол|амброксолл", 
             "моксифлоксацин", 'пле....кс.|мокс.......цин',
             "молсидомин","м.лсид...н",
             "спиронолактон","сп.р.......он.|верош....н",
             "бисопролол","б.с.пр..ол|бисопралдол|бикард|конкор", 
             "лансопрозол", "лан......ол|ланс.зол",
             "меропенем","мер....ем",
             "аторвастатин", "липромак|аторв.......",
             "дексаметазон", "декс.......н|дексаетазон",
             "левофлоксацин", "лев.......цин",
             "омепразол", "омез|омепр..ол",
             "азитромицин", "азит.......",
             "кандесартан", "к.с.рк",
             "амоксициллин", "амоксицилин|амо........н",
             "озельтамивир", "флустоп|озел.......р",
             "эноксапарин", "клексан|кл...ан",
             "имепенем", "им....ем",
             "клопидогрел", "клопидогрель|плавикс|клорпидогрель",
             "аспикард", "аспкиард|кардиомагнил|ас....рд",
             "амлодипин","амл....ин",
             "амикацин", "ам.к...н",
             "индапамид", "индап|инд.....д",
             "беродуал", "бер.дуал|ипратропия.бромид",
             "ацетилцистеин", "ацецемед|асс|асс|ацц|ацемед|ацецезон",
             "парацетамол", "парац.....л",
             "гидроксихлорохин", "плаквенил|имар.|иммар.",
             "метилпреднизолон", "медрол|м.дрол|метипред|диметилпреднизолон",
             "теофиллин", "теофилин|теотард|теофилл",
             "кларитромицин", "кларибацин|кла.......цин",
             "лозартан", "лазртан|л...ртан|л.риста",
             "валсартан", "валозартан|валз|вал....ан",
             "моксонидин", "м.кс.н.дин",
             "амиодарон", "ами.д.р.н|к.рд.рон",
             "полимиксин B", "колистин|колистат|к.л.стат",
             "преднизолон", "преднезолон|пре.н.з.лон",
             "рамиприл", "рам.л...|рам.прил",
             "карбомазепин", "карб.м.з.п.н",
             "кетаролак", "кет.р.лак|кет.рол|кет.н.в",
             "гентамицин", "г.нт.мицин",
             "цефепим", "ц.ф.пим",
             "цефоперазон/сульбактам", "цеф.пер.зон|цеф.пер.зон.су.......",
             "тайгециклин", "тиг.циклин|та.г.циклин",
             "зопиклон", "з.п.клон|соне.|соне.с")
  
  
  trueNames <- masks[seq(1, length(masks), 2)]
  namesToChange <- masks[seq(2, length(masks), 2)]
  
  for(index in 1:length(trueNames)) {
    file_ <- gsub(
      namesToChange[index],
      trueNames[index],
      file_
    )
  }
  output <- lapply(file_, 
                   function(diagnosis){
                     ceftriaxone <- fifelse(str_detect("цефтриаксон"), 1, 0)
                     
                     
                     
                   })
  

  return( tibble::tibble(
    patientIds <- unlist(id),
    birthday <- unlist(birthday),
    treatment <- file_
    
  ))
}
test <- getTreatmentTable(DT)
